Repository: Thibault-Santonja/phoenix
Catalog: priv/gettext/*/LC_MESSAGES/default.po
Languages: fr

source: Attempting to reconnect
fr: Tentative de reconnexion

source: Author image
fr: Auteur

source: Cancel upload for %{file}
fr: Annuler l'envoi de %{file}

source: Close menu
fr: Fermer le menu

source: Close sidebar
fr: Ferme la barre latérale

source: Copied!
fr: Copié!

source: Copy failed
fr: Echec de la copie

source: Copy to clipboard
fr: Copié dans le presse-papiers

source: Drawer content
fr: Contenu

source: Error!
fr: Erreur!

source: Filter options
fr: Options de filtre

source: First page
fr: Première page

source: Go to page %{page}
fr: Aller à la page %{page}

source: Go to slide %{index}
fr: Aller à la diapo %{index}

source: Hang in there while we get back on track
fr: Tenez bon pendant que nous nous remettons sur les rails

source: Last page
fr: Dernière page

source: Loading...
fr: Chargement...

source: Minimize sidebar
fr: Réduire la barre latérale

source: Next page
fr: Page suivante

source: Nothing found!
fr: Rien n'a été trouvé!

source: Open actions menu
fr: Ouvrir le menu des actions

source: Page %{page}, current page
fr: Page %{page}, page actuelle

source: Previous page
fr: Page précédente

source: Rate %{count} star
fr: Noté %{count} étoiles

source: Something went wrong!
fr: Quelque chose a mal tourné!

source: Step %{number}: %{title}
fr: Étape %{number}: %{title}

source: Success!
fr: Succès!

source: Time:
fr: Temps:

source: Uploading %{file}
fr: Téléchargement de %{file}

source: Uploading %{file}: %{progress} percent
fr: Téléchargement de %{file}: %{progress}%

source: We can't find the internet
fr: Nous n'arrivons pas à trouver l'internet

source: Your browser does not support the video tag.
fr: Votre navigateur ne prend pas en charge la balise vidéo.

source: close
fr: Fermer

source: Clothes XIVc in western Europe
fr: Vetements XIVe en Europe de l'ouest

source: Shoes XIVc in western Europe
fr: Chaussures XIVe en Europe de l'ouest

source: China
fr: Chine

source: Events
fr: Événements

source: Japan
fr: Japon

source: Motherhood
fr: Maternité

source: Music
fr: Musique

source: Re-enactment
fr: Reconstitution

source: Street photo
fr: Photo de rue

source: Taiwan
fr: Taïwan

source: Weeding
fr: Mariage

source: Clothes
fr: Vêtements

source: Shoes
fr: Chaussures

source: The tech blog
fr: Le tech blog

source: As part of building and maintaining a reliable LiveView site, a solid CI pipeline is essential.
fr: Dans le cadre de la construction et du maintien d'un site LiveView fiable, un pipeline CI solide est essentiel.

source: At the time of writing, the app doesn’t rely on a database like Postgres, but we’ve left support commented out for future expansion.
fr: Au moment où nous écrivons ces lignes, l'application ne repose pas sur une base de données comme Postgres, mais nous avons laissé le support commenté pour une expansion future.

source: Builds and pushes the image using
fr: Construit et pousse l'image en utilisant

source: Builds the Phoenix release with static assets
fr: Construit la version Phoenix avec des actifs statiques

source: Continuous Integration for a Phoenix LiveView Site (Without Postgres)
fr: Intégration continue pour un site Phoenix LiveView (sans Postgres)

source: Docker Image Release
fr: Publication d'une image Docker

source: If you’re building a Phoenix LiveView site without a database, this is a good baseline.
fr: Si vous construisez un site Phoenix LiveView sans base de données, c'est une bonne base.

source: Job Overview
fr: Apreçu des jobs

source: Logs into Docker Hub using secrets
fr: Se connecte à Docker Hub en utilisant des secrets

source: On any push to the
fr: Lors de tout push vers le

source: On each tagged commit, the workflow:
fr: Sur chaque commit tagué, le flux de travail:

source: On pull requests targeting
fr: Sur les pull requests vers

source: The CI pipeline runs automatically:
fr: La pipeline CI s'exécute automatiquement :

source: Triggers
fr: Déclencheurs

source: We use
fr: Nous utilisons

source: When a new tag is pushed (used for Docker image release)
fr: Quand un nouveau tag est créé (utilisé pour la création de la Docker Image)

source: When you're ready to enable Postgres, the foundation is already there.
fr: Lorsque vous êtes prêt à activer Postgres, les fondations sont déjà là.

source: branch
fr: branche

source: for CI, which gives us clean, isolated environments and good integration with Docker Hub and versioned releases.
fr: pour CI, ce qui nous donne des environnements propres et isolés et une bonne intégration avec Docker Hub et les versions versionnées.

source: 5.1 Sample kamal.yml
fr: 5.1 Extrait de kamal.yml

source: 5.2 Explanation
fr: 5.2 Explications

source: 5.3 Example .env.secret
fr: 5.3 Exemple d'un .env.secret

source: A Dockerfile for the app
fr: Une Dockerfile pour l'app

source: A VPS with SSH access (e.g. Hetzner)
fr: Un VPS (Virtual Private Server ou serveur dédié virtuel) avec une connexion SSH (e.g. Hetzner (DE), OVH (FR), Infomaniak (CH)...)

source: A domain name managed by Cloudflare or similar
fr: Un nom de domain managé par un provider comme Cloudflare

source: A growing collection of ideas, tools, and experiments in web development, DevOps, and medieval digital humanities.
fr: Une collection croissante d'idées, d'outils et d'expériences en développement web, DevOps et humanités numériques médiévales.

source: An application to deploy
fr: Une application à déployer

source: By caching mix and build artifacts per tool version and environment, we also save time on repeat CI runs:
fr: En mettant en cache les artefacts de mixage et de construction par version d'outil et par environnement, nous gagnons également du temps sur les exécutions répétées de CI :

source: Compared to solutions like Fly.io, which abstract away the infrastructure, Kamal gives you full control while keeping the workflow efficient and reproducible.
fr: Comparé à des solutions comme Fly.io, qui font abstraction de l'infrastructure, Kamal vous donne un contrôle total tout en gardant le flux de travail efficace et reproductible.

source: Configuring Kamal
fr: Configurer Kamal

source: Defined Tool Versions
fr: Version d'outils définit

source: Deploying a Phoenix App with Kamal and Docker on a VPS
fr: Déployer une application Phoenix avec Kamal & Docker sur un VPS

source: Deploying with Kamal
fr: Déployer avec Kamal

source: Deployment
fr: Déploiement

source: Docker-native: builds and deploys containers without needing additional orchestration tools.
fr: Docker-native : construit et déploie des conteneurs sans avoir besoin d'outils d'orchestration supplémentaires.

source: Easy rollback and redeploy with simple commands like `kamal deploy` or `kamal rollback`.
fr: Retour en arrière et redéploiement faciles avec des commandes simples comme `kamal deploy` ou `kamal rollback`.

source: Edit the generated files under config/deploy to match your app, domain, and VPS settings. Define environment variables, ports, and Docker image name.
fr: Modifiez les fichiers générés sous config/deploy pour qu'ils correspondent à vos paramètres d'application, de domaine et de VPS. Définissez les variables d'environnement, les ports et le nom de l'image Docker.

source: Environment variables that are safe to commit (e.g. hostname, database URL).
fr: Variables d'environnement qu'il est sécuriser de commit (p.e. nom de domaine).

source: Explanation
fr: Explication

source: Explore how the site is built and deployed using GitHub Actions, Docker, and Elixir Phoenix.
fr: Explorer comment le site est construit et déployé en utilisant les actions GitHub, Docker et Elixir Phoenix.

source: For the moment, I haven't pipelined the deployment. To avoid rebuilding the image and push the build image directly into the CI, Kamal offers these options:
fr: Pour l'instant, je n'ai pas pipelisé le déploiement. Pour éviter de reconstruire l'image et pousser l'image de construction directement dans le CI, Kamal offre ces options :

source: Full Docker image name, hosted on GitHub Container Registry in this case.
fr: Nom complet de l'image Docker, hébergée sur DockerHub dans ce cas.

source: Here's how I configured Kamal for my own Phoenix project deployed to a Hetzner VPS using Docker and PostgreSQL.
fr: Voici comment j'ai configuré Kamal pour mon propre projet Phoenix déployé sur un VPS Hetzner en utilisant Docker et PostgreSQL.

source: How I use Kamal to deploy Phoenix apps with Docker on a VPS — simple, elegant, and production-ready.
fr: Comment j'utilise Kamal pour déployer des applications Phoenix avec Docker sur un VPS — simple, élégant et prêt pour la production.

source: If a Git tag is pushed, it also builds and pushes a Docker image to Docker Hub using the configured secrets.
fr: Si un tag Git est poussé, il construit également et pousse une image Docker vers Docker Hub en utilisant les secrets configurés.

source: If needed, builds the image remotely to match your server architecture (e.g. amd64).
fr: Si nécessaire, construit l'image à distance pour correspondre à l'architecture de votre serveur (par exemple amd64).

source: If you're looking for a straightforward and self-hosted deployment solution for Elixir Phoenix apps, Kamal is a fantastic choice.
fr: Si vous recherchez une solution de déploiement autonome et simple pour les applications Elixir Phoenix, Kamal est un choix fantastique.

source: In both local development and CI, this ensures everyone — and every job — uses the same versions.
fr: En développement local comme en CI, cela garantit que tout le monde — et chaque tâche — utilise les mêmes versions.

source: In the CI, we use the official
fr: Dans la CI, nous utilisons l'officiel

source: In this guide, I'll talk about how to deploy a Phoenix (Elixir) app to a VPS using Kamal, a deployment tool developed by the team behind Ruby on Rails. Kamal provides a simple and powerful way to deploy containerized apps over SSH with Docker.
fr: Dans ce guide, je vais expliquer comment déployer une application Phoenix (Elixir) sur un VPS en utilisant Kamal, un outil de déploiement développé par l'équipe derrière Ruby on Rails. Kamal offre une façon simple et puissante de déployer des applications conteneurisées via SSH avec Docker.

source: Installing Kamal
fr: Installation de Kamal

source: It ensures consistency across development and CI by aligning the tool versions defined in
fr: Il assure la cohérence entre le développement et la CI en alignant les versions des outils définies dans

source: It ensures the application behaves as expected.
fr: Il garantit que l'application se comporte comme prévu.

source: It uses production settings to ensure that the compiled output matches what will be deployed.
fr: Il utilise les paramètres de production pour s'assurer que la sortie compilée correspond à ce qui sera déployé.

source: It's easy and straight forward !
fr: C'est facile et direct !

source: Kamal is a great choice for Phoenix developers who want a fast, reliable deployment pipeline without complex orchestration. Combined with Docker and a VPS like Hetzner, it provides full control over your stack.
fr: Kamal est un excellent choix pour les développeurs Phoenix qui veulent une pipeline de déploiement rapide et fiable sans orchestration complexe. Combiné avec Docker et un VPS comme Hetzner, il offre un contrôle total sur votre stack.

source: Kamal will build the Docker image, push it, connect to your VPS, and deploy the containers. Use Kamal commands like
fr: Kamal va construire l'image Docker, la pousser, se connecter à votre VPS, et déployer les conteneurs. Utilisez les commandes Kamal comme

source: Line
fr: Ligne

source: Minimal configuration: a single kamal.yml file controls everything.
fr: Configuration minimale : un seul fichier kamal.yml contrôle tout.

source: Mise also lets you define CLI tasks, so you can standardize common workflows like setup, cleanups, and deployment helpers.
fr: Mise vous permet également de définir des tâches CLI, vous pouvez donc standardiser les flux de travail courants comme la configuration, les nettoyages et les assistants de déploiement.

source: Mise in CI
fr: 'Mise' dans la CI

source: Mise is a modern version manager that supports multiple languages and tools — similar to asdf, but faster and easier to configure.
fr: Mise est un gestionnaire de versions moderne qui prend en charge plusieurs langages et outils — similaire à asdf, mais plus rapide et plus facile à configurer.

source: My latest articles
fr: Mes derniers articles

source: No more surprises between your machine and GitHub Actions!
fr: Plus de surprises entre votre machine et GitHub Actions !

source: No vendor lock-in: works with any VPS or cloud provider.
fr: Pas de dépendance à un fournisseur : fonctionne avec n'importe quel VPS ou fournisseur cloud.

source: Once a functional app base has been created (in the case of an Elixir / Phoenix app, a simple `mix phx.new my_app` will suffice), it needs to be containerised. Kamal will need a container to deploy on the VPS. This container may not be hosted on Docker Hub, but in my case it is. By default, Phoenix offers a Docker file, which can be generated with the command `mix phx gen.release --docker`, which may do the trick. In my case I preferred to make a new one. An Elixir app is easy to containerise, so I took advantage!
fr: Une fois qu'une base d'application fonctionnelle a été créée (dans le cas d'une application Elixir / Phoenix, un simple `mix phx.new my_app` suffira), elle doit être conteneurisée. Kamal aura besoin d'un conteneur à déployer sur le VPS. Ce conteneur peut ne pas être hébergé sur Docker Hub, mais dans mon cas, il l'est. Par défaut, Phoenix propose un fichier Docker, qui peut être généré avec la commande `mix phx gen.release --docker`, ce qui peut faire l'affaire. Dans mon cas, j'ai préféré en créer un nouveau. Une application Elixir est facile à conteneuriser, j'en ai donc profité !

source: Once configured, deploy your app with:
fr: Une fois configuré, déployez votre application avec :

source: Overall, Kamal bridges the gap between manual server management and fully managed platforms, providing a great balance of simplicity, power, and transparency.
fr: Dans l'ensemble, Kamal comble le fossé entre la gestion manuelle des serveurs et les plateformes entièrement gérées, offrant un excellent équilibre entre simplicité, puissance et transparence.

source: Points to a secret .env file (not committed) used for sensitive data like SECRET_KEY_BASE.
fr: Pointe vers un fichier .env secret (non commité) utilisé pour les données sensibles comme SECRET_KEY_BASE.

source: PostgreSQL is commented out for now because the project does not currently require a database, but the configuration is ready for future use.
fr: PostgreSQL est commenté pour l'instant car le projet ne nécessite pas actuellement de base de données, mais la configuration est prête pour une utilisation future.

source: Preparing Your App
fr: Préparer votre application

source: Public IP address of your VPS.
fr: Adresse IP publique de votre VPS.

source: Registry credentials for pushing images (GitHub, DockerHub, etc.).
fr: Identifiants de registre pour pousser des images (GitHub, DockerHub, etc.).

source: Remote builder support: useful when your local architecture differs from the server (e.g., M1 Mac to amd64 VPS).
fr: Support de construction à distance : utile lorsque votre architecture locale diffère du serveur (par exemple, M1 Mac vers VPS amd64).

source: Requirements
fr: Prérequis

source: Reusable Tasks
fr: Tâches réutilisables

source: Ruby >= 3.1 (for Kamal)
fr: Ruby >= 3.1 (pour Kamal)

source: SSH user on the VPS, typically 'deploy' or 'root'.
fr: Utilisateur SSH sur le VPS, généralement 'deploy' ou 'root'.

source: Secure secrets management: easily handles private .env files.
fr: Gestion sécurisée des secrets : gère facilement les fichiers .env privés.

source: The BUILD job compiles the application, builds the assets, and generates a release.
fr: Le job BUILD compile l'application, construit les assets et génère une release.

source: The LINT job enforces code quality and security rules. It checks for formatting, unused dependencies, security vulnerabilities, and stylistic issues.
fr: Le job LINT applique les règles de qualité de code et de sécurité. Il vérifie le formatage, les dépendances inutilisées, les vulnérabilités de sécurité et les problèmes stylistiques.

source: The name of your app/service, consistent with your Docker image and Elixir project.
fr: Le nom de votre application/service, cohérent avec votre image Docker et votre projet Elixir.

source: The tech blog is under construction — come back soon for articles on Elixir, Phoenix, CI/CD, and more !.
fr: Le blog est en construction — revenez bientôt pour des articles sur Elixir, Phoenix, CI/CD, et plus !

source: These tasks are great for onboarding and automation.
fr: Ces tâches sont excellentes pour l'intégration et l'automatisation.

source: This file should be kept out of version control. Kamal will read it and inject the variables into the container.
fr: Ce fichier doit être maintenu en dehors du contrôle de version. Kamal le lira et injectera les variables dans le conteneur.

source: This job initializes the CI environment by installing all required tools using
fr: Ce job initialise l'environnement CI en installant tous les outils requis en utilisant

source: This job runs the test suite with
fr: Ce job exécute la suite de tests avec

source: This setup guarantees consistent runtime environments:
fr: Cette configuration garantit des environnements d'exécution cohérents :

source: This speeds up builds, avoids mismatched versions, and keeps CI mirrors of local dev environments.
fr: Cela accélère les builds, évite les versions incompatibles et maintient des environnements CI miroirs des environnements de développement locaux.

source: To install Kamal, follow the doc using RubyGems:
fr: Pour installer Kamal, suivez la documentation en utilisant RubyGems :

source: Tools
fr: Outils

source: Tools like
fr: Des outils comme

source: Unlike manual deployments that require repetitive steps, or Ansible that adds a layer of complexity, Kamal offers a modern, Ruby-based deployment tool that is simple, transparent, and Docker-native.
fr: Contrairement aux déploiements manuels qui nécessitent des étapes répétitives, ou à Ansible qui ajoute une couche de complexité, Kamal offre un outil de déploiement moderne basé sur Ruby qui est simple, transparent et natif à Docker.

source: Use Kamal to initialize your deployment configuration:
fr: Utilisez Kamal pour initialiser votre configuration de déploiement :

source: Using Kamal to deploy a Phoenix application has significantly simplified the process compared to traditional methods like manual SSH setup, Ansible playbooks, or even some PaaS solutions.
fr: L'utilisation de Kamal pour déployer une application Phoenix a considérablement simplifié le processus par rapport aux méthodes traditionnelles comme la configuration SSH manuelle, les playbooks Ansible, ou même certaines solutions PaaS.

source: Using a single configuration file (`mise.toml`), you can define the exact versions of tools like Elixir, Erlang, Ruby, and even JavaScript runtimes like Bun.
fr: En utilisant un seul fichier de configuration (`mise.toml`), vous pouvez définir les versions exactes d'outils comme Elixir, Erlang, Ruby, et même des environnements JavaScript comme Bun.

source: Welcome to Thibault's dev blog
fr: Bienvenue sur le blog de développement de Thibault

source: What Is Mise?
fr: Qu'est-ce que Mise ?

source: Why Kamal?
fr: Pourquoi Kamal ?

source: and
fr: et

source: are used to ensure the codebase stays clean and secure.
fr: sont utilisés pour garantir que le code reste propre et sécurisé.

source: to install and cache these tools quickly.
fr: pour installer et mettre en cache ces outils rapidement.

source: 1. Why Elixir is Powerful for today and tomorrow usages
fr: 1. Pourquoi Elixir est puissant pour les usages d'aujourd'hui et de demain

source: 1. Why Elixir is really powerful
fr: 1. Pourquoi Elixir est vraiment puissant

source: 2. What Is the BEAM? Understanding the Virtual Machine Behind Elixir
fr: 2. Qu'est-ce que BEAM ? Comprendre la machine virtuelle derrière Elixir

source: 2. What is the BEAM machine
fr: 2. Qu'est-ce que la machine BEAM

source: 3. What Is a GenServer? Concurrency with Abstraction
fr: 3. Qu'est-ce qu'un GenServer ? La concurrence avec abstraction

source: 3. What is GenServer and concurrency
fr: 3. Qu'est-ce que GenServer et la concurrence

source: 4. Real-World Use Cases: Why Elixir Shines in Production
fr: 4. Cas d'utilisation réels : Pourquoi Elixir brille en production

source: 4. Real-world use cases for GenServer
fr: 4. Cas d'utilisation réels pour GenServer

source: 5. Supervisors: Building Fault-Tolerant Systems
fr: 5. Superviseurs : Construire des systèmes tolérants aux pannes

source: 5. What is a Supervisor and fault tolerance
fr: 5. Qu'est-ce qu'un Superviseur et la tolérance aux pannes

source: 6. What is an OTP Application? Building Scalable and Distributed Systems
fr: 6. Qu'est-ce qu'une application OTP ? Construire des systèmes évolutifs et distribués

source: 6. What is an OTP application
fr: 6. Qu'est-ce qu'une application OTP

source: A Supervisor is a special process whose job is to monitor and restart child processes when they fail. This design promotes high availability and fault isolation by ensuring that failures are contained and automatically recovered from.
fr: Un Superviseur est un processus spécial dont le travail est de surveiller et redémarrer les processus enfants lorsqu'ils échouent. Cette conception favorise la haute disponibilité et l'isolation des pannes en garantissant que les défaillances sont contenues et automatiquement récupérées.

source: A `GenServer` is a generic server process — a behavior module provided by Elixir that helps you encapsulate state, handle messages, and manage synchronous or asynchronous operations.
fr: Un `GenServer` est un processus serveur générique — un module de comportement fourni par Elixir qui vous aide à encapsuler l'état, gérer les messages et gérer des opérations synchrones ou asynchrones.

source: APIs at scale
fr: APIs à grande échelle

source: An OTP Application typically defines a supervision tree and is started by the BEAM runtime when your project boots. This pattern enables you to structure your code as modular and resilient components, ideal for long-running services like web servers, messaging queues, or background job processors.
fr: Une application OTP définit généralement un arbre de supervision et est démarrée par le runtime BEAM au démarrage de votre projet. Ce modèle vous permet de structurer votre code en composants modulaires et résilients, idéaux pour les services de longue durée comme les serveurs web, les files d'attente de messagerie ou les processeurs de tâches en arrière-plan.

source: At the heart of Elixir lies the BEAM — the Erlang virtual machine — purpose-built for running thousands to millions of lightweight processes simultaneously.
fr: Au cœur d'Elixir se trouve BEAM — la machine virtuelle Erlang — conçue spécifiquement pour exécuter simultanément des milliers à des millions de processus légers.
