Repository: Thibault-Santonja/phoenix
Catalog: priv/gettext/*/LC_MESSAGES/default.po
Languages: fr

source: At the heart of every Elixir project lies an OTP Application — a standardized way to package, configure, and run an Elixir system. An OTP Application is more than a module or a set of functions: it's a self-contained unit of behavior that defines how your app starts, supervises its processes, and integrates with other applications.
fr: Au cœur de chaque projet Elixir se trouve une application OTP — une façon standardisée d'empaqueter, configurer et exécuter un système Elixir. Une application OTP est plus qu'un module ou un ensemble de fonctions : c'est une unité autonome de comportement qui définit comment votre application démarre, supervise ses processus et s'intègre avec d'autres applications.

source: Background processing
fr: Traitement en arrière-plan

source: Chat applications
fr: Applications de chat

source: Conclusion and performance considerations
fr: Conclusion et considérations de performance

source: Conclusion: Performance, Interoperability, and What's Next
fr: Conclusion : Performance, Interopérabilité et ce qui suit

source: Each call to `spawn/1` creates a new process in less time and memory than a typical thread. These processes are entirely managed by the BEAM, offering fault isolation, parallelism, and scalability.
fr: Chaque appel à `spawn/1` crée un nouveau processus en moins de temps et avec moins de mémoire qu'un thread typique. Ces processus sont entièrement gérés par BEAM, offrant isolation des pannes, parallélisme et évolutivité.

source: Each process runs in a preemptively scheduled environment with its own heap and stack. The BEAM schedules these processes in small reductions (units of execution) and guarantees fairness, allowing responsive systems even under high load.
fr: Chaque processus s'exécute dans un environnement planifié de manière préemptive avec son propre tas et sa propre pile. BEAM planifie ces processus en `petites réductions` (unités d'exécution) et garantit l'équité, permettant des systèmes réactifs même sous forte charge.

source: Elixir handles large volumes of incoming data efficiently, with GenServers maintaining state and processing in parallel.
fr: Elixir gère efficacement de grands volumes de données entrantes, avec des GenServers qui maintiennent l'état et traitent en parallèle.

source: Elixir is a functional and concurrent programming language built on top of the Erlang VM (BEAM), which was designed from the ground up for building scalable and fault-tolerant systems. In a world increasingly reliant on distributed, real-time applications, Elixir's model is more relevant than ever. This article explores why Elixir stands out for concurrent software development, how its runtime operates, and how developers can build reliable and performant systems using tools like GenServer, Supervisors, and OTP applications.
fr: Elixir est un langage de programmation fonctionnel et concurrent construit sur la VM Erlang (BEAM), qui a été conçue de A à Z pour construire des systèmes évolutifs et tolérants aux pannes. Dans un monde de plus en plus dépendant des applications distribuées en temps réel, le modèle d'Elixir est plus pertinent que jamais. Cet article explore pourquoi Elixir se démarque pour le développement logiciel concurrent, comment son runtime fonctionne, et comment les développeurs peuvent construire des systèmes fiables et performants en utilisant des outils comme GenServer, les Superviseurs, et les applications OTP.

source: Elixir is built on the Erlang VM (BEAM), which was designed from the start to support massive concurrency, fault-tolerant systems, and high availability — qualities that are becoming non-negotiable in modern web services, real-time applications, and distributed platforms.
fr: Elixir est construit sur la VM Erlang (BEAM), qui a été conçue dès le départ pour supporter une concurrence massive, des systèmes tolérants aux pannes et une haute disponibilité — des qualités qui deviennent non négociables dans les services web modernes, les applications en temps réel et les plateformes distribuées.

source: Elixir's Concurrency Model
fr: Le modèle de concurrence d'Elixir

source: Elixir's strength lies in its concurrency model, fault-tolerant design, and its ability to scale efficiently for IO-heavy, distributed applications. However, it's important to understand that Elixir — running on the BEAM — is not optimized for raw CPU-intensive computation.
fr: La force d'Elixir réside dans son modèle de concurrence, sa conception tolérante aux pannes et sa capacité à évoluer efficacement pour les applications distribuées à forte intensité d'E/S. Cependant, il est important de comprendre qu'Elixir — fonctionnant sur BEAM — n'est pas optimisé pour les calculs intensifs bruts du CPU.

source: For example, a cluster of OTP applications can coordinate work across nodes, balance load, or recover from partial failures — making Elixir a powerful choice for building distributed systems, microservices, and globally available APIs.
fr: Par exemple, un cluster d'applications OTP peut coordonner le travail entre les nœuds, équilibrer la charge ou récupérer après des défaillances partielles — faisant d'Elixir un choix puissant pour construire des systèmes distribués, des microservices et des API disponibles mondialement.

source: For instance, Discord originally used Elixir to reduce latency and improve reliability for millions of concurrent voice connections. Elixir helped them simplify complexity without sacrificing performance.
fr: Par exemple, Discord a initialement utilisé Elixir pour réduire la latence et améliorer la fiabilité pour des millions de connexions vocales simultanées. Elixir les a aidés à simplifier la complexité sans sacrifier les performances.

source: Here are some concrete examples of where Elixir shines:
fr: Voici quelques exemples concrets où Elixir brille :

source: Here is a minimal example of a GenServer implementation:
fr: Voici un exemple minimal d'implémentation d'un GenServer :

source: Here's an example of spawning thousands of processes in Elixir — a common pattern, thanks to the BEAM's efficiency.
fr: Voici un exemple de création de milliers de processus dans Elixir — un modèle courant, grâce à l'efficacité de BEAM.

source: In an upcoming article, we'll dive into Phoenix, LiveView, and how Elixir enables real-time, interactive web applications — with less JavaScript and more reliability.
fr: Dans un prochain article, nous plongerons dans Phoenix, LiveView, et comment Elixir permet de créer des applications web interactives en temps réel — avec moins de JavaScript et plus de fiabilité.

source: In this example, MyApp.Supervisor starts a MyApp.Worker GenServer. If that worker crashes, the supervisor restarts it automatically, using the :one_for_one strategy. Other strategies include :one_for_all and :rest_for_one, depending on how processes are related.
fr: Dans cet exemple, MyApp.Supervisor démarre un GenServer MyApp.Worker. Si ce worker plante, le superviseur le redémarre automatiquement, en utilisant la stratégie :one_for_one. D'autres stratégies incluent :one_for_all et :rest_for_one, selon la relation entre les processus.

source: IoT and telemetry
fr: IoT et télémétrie

source: It abstracts away the message-passing boilerplate and encourages a consistent architecture. Using `GenServer`, developers can focus on application logic while relying on proven patterns for reliability and supervision.
fr: Il abstrait le code standard de passage de messages et encourage une architecture cohérente. En utilisant `GenServer`, les développeurs peuvent se concentrer sur la logique de l'application tout en s'appuyant sur des modèles éprouvés pour la fiabilité et la supervision.

source: Its supervision trees make applications self-healing and resilient by design — a vital feature for systems that require near-zero downtime, like messaging platforms, IoT backends, and fintech applications.
fr: Ses arbres de supervision rendent les applications auto-réparatrices et résilientes par conception — une caractéristique vitale pour les systèmes qui nécessitent un temps d'arrêt quasi nul, comme les plateformes de messagerie, les backends IoT et les applications fintech.

source: Libraries like Oban use GenServer and supervision trees to manage job queues, retries, and scheduling reliably.
fr: Des bibliothèques comme Oban utilisent GenServer et les arbres de supervision pour gérer de manière fiable les files d'attente de tâches, les nouvelles tentatives et la planification.

source: Looking Ahead: Phoenix and the Web
fr: Perspectives : Phoenix et le Web

source: OTP Applications can easily be combined and deployed across nodes in a distributed system. With node-to-node communication, you can scale horizontally and delegate tasks between different physical or virtual machines.
fr: Les applications OTP peuvent facilement être combinées et déployées sur plusieurs nœuds dans un système distribué. Avec la communication de nœud à nœud, vous pouvez évoluer horizontalement et déléguer des tâches entre différentes machines physiques ou virtuelles.

source: OTP Applications in Distributed Systems
fr: Applications OTP dans les systèmes distribués

source: Phoenix web servers, job processing platforms like Oban, and chat systems all leverage OTP applications behind the scenes. Each application encapsulates its logic, dependencies, and supervision trees, making them easy to compose and maintain.
fr: Les serveurs web Phoenix, les plateformes de traitement de tâches comme Oban et les systèmes de chat utilisent tous des applications OTP en coulisse. Chaque application encapsule sa logique, ses dépendances et ses arbres de supervision, les rendant faciles à composer et à maintenir.

source: Processes are lightweight and isolated, making Elixir ideal for handling thousands of concurrent users. Phoenix Channels make real-time communication trivial.
fr: Les processus sont légers et isolés, rendant Elixir idéal pour gérer des milliers d'utilisateurs simultanés. Les Phoenix Channels rendent la communication en temps réel triviale.

source: Quick dig into Elixir's concurrency model and its impact on building scalable applications.
fr: Plongée rapide dans le modèle de concurrence d'Elixir et son impact sur la construction d'applications évolutives.

source: Thanks to the underlying Erlang VM, Elixir applications handle high throughput with low latency, even under heavy load.
fr: Grâce à la VM Erlang sous-jacente, les applications Elixir gèrent un débit élevé avec une faible latence, même sous forte charge.

source: Thanks to tools like Rustler or NIFs (Native Implemented Functions), you can strike a balance: keep your business logic and resilience in Elixir, while offloading the most CPU-heavy logic to native code.
fr: Grâce à des outils comme Rustler ou les NIFs (Native Implemented Functions), vous pouvez trouver un équilibre : garder votre logique métier et votre résilience dans Elixir, tout en déchargeant la logique la plus gourmande en CPU vers du code natif.

source: The MyApp.Application module defines the entry point of your application. When deployed, this module ensures that your system starts in a predictable, fault-tolerant way using the supervision tree.
fr: Le module MyApp.Application définit le point d'entrée de votre application. Une fois déployé, ce module garantit que votre système démarre de manière prévisible et tolérante aux pannes en utilisant l'arbre de supervision.

source: The future-proof Elixir programing language
fr: Le langage de programmation Elixir, paré pour l'avenir

source: This `Counter` module starts a process with an initial value, supports incrementing it asynchronously via `cast`, and retrieving the current value with `call`.
fr: Ce module `Counter` démarre un processus avec une valeur initiale, permet de l'incrémenter de manière asynchrone via `cast`, et de récupérer la valeur actuelle avec `call`.

source: This architecture also enables hot code swapping, letting you update parts of your system in production without stopping the application — a critical advantage for systems that require continuous availability.
fr: Cette architecture permet également le remplacement à chaud du code, permettant de mettre à jour des parties du système en production sans arrêter l'application — un avantage crucial pour les systèmes qui nécessitent une disponibilité continue.

source: This article focused on the foundations of Elixir and the BEAM, but there's even more power waiting in the Elixir ecosystem. The Phoenix Framework builds on top of these concepts to provide a full-featured, scalable web development platform.
fr: Cet article s'est concentré sur les fondements d'Elixir et de BEAM, mais il y a encore plus de puissance qui attend dans l'écosystème Elixir. Le framework Phoenix s'appuie sur ces concepts pour fournir une plateforme de développement web complète et évolutive.

source: This modularity is one of the reasons why Elixir systems are considered easy to reason about — even as they scale to millions of users.
fr: Cette modularité est l'une des raisons pour lesquelles les systèmes Elixir sont considérés comme faciles à comprendre — même lorsqu'ils évoluent pour servir des millions d'utilisateurs.

source: To handle performance-critical operations, many teams combine Elixir with native code written in Rust or C. One of the most famous examples is Discord, which replaced certain parts of its Elixir stack with Rust-based components to improve performance, while keeping the benefits of Elixir for the rest of the system.
fr: Pour gérer les opérations critiques en termes de performance, de nombreuses équipes combinent Elixir avec du code natif écrit en Rust ou C. L'un des exemples les plus célèbres est Discord, qui a remplacé certaines parties de sa pile Elixir par des composants basés sur Rust pour améliorer les performances, tout en conservant les avantages d'Elixir pour le reste du système.

source: Used in Production Systems
fr: Utilisé dans les systèmes de production

source: Using GenServer encourages fault-tolerant and well-organized concurrent code, especially when combined with Elixir's supervision trees.
fr: L'utilisation de GenServer favorise un code concurrent tolérant aux pannes et bien organisé, en particulier lorsqu'il est combiné avec les arbres de supervision d'Elixir.

source: While Elixir allows you to spawn raw processes using `spawn/1`, it also offers powerful abstractions like `GenServer` for building robust, concurrent systems with clear structure.
fr: Bien qu'Elixir permette de créer des processus bruts en utilisant `spawn/1`, il offre également de puissantes abstractions comme `GenServer` pour construire des systèmes concurrents robustes avec une structure claire.

source: With supervision trees, Elixir apps gracefully recover from runtime failures, making them ideal for systems that require high availability, like banking platforms, messaging services, and distributed web applications.
fr: Avec les arbres de supervision, les applications Elixir récupèrent élégamment des défaillances d'exécution, ce qui les rend idéales pour les systèmes qui nécessitent une haute disponibilité, comme les plateformes bancaires, les services de messagerie et les applications web distribuées.

source: A curated digital bookshelf
fr: Une bibliothèque numérique repensée

source: A quiet place shaped by hand and heart,
fr: Un endroit calme façonné par la main et le cœur,

source: Breathing life into history, and kindling a strong friendship community of care, curiosity, and craft
fr: Donner souffle à l’histoire, et faire naître une communauté d’amitié, de curiosité et de savoir-faire.

source: Fragments of light, stories without words and emotional journey
fr: Fragments de lumière, histoires visuelles et voyage émotionnel

source: Here, you can wander through the different threads of my work:
fr: Ici, vous pouvez vous promener à travers les différents fils de mon travail :

source: Photography
fr: Photographie

source: Software crafter
fr: Artisan logiciel

source: Take your time, each path tells a part of the story.
fr: Prenez le temps — chaque voie murmure un morceau d’histoire.

source: The bookshelf
fr: La librarie

source: Thoughtful crafted code, shaped with care for people and planet
fr: Un code pensé avec soin, façonné dans le respect des personnes et de la planète

source: Welcome to my digital workshop
fr: Bienvenue dans mon atelier digital

source: Where light meets ink, Where code meets craft.
fr: Là où la lumière rejoint l’encre, là où le code épouse l’artisanat.

source: E-mail me
fr: Contactez moi

source: Facebook profile
fr: Profil Facebook

source: Github profile
fr: Profil Github

source: Instagram profile
fr: Profil Instagram

source: Linkedin profile
fr: Profil Linkedin

source: Thibault Santonja - Creative and technical portfolio
fr: Thibault Santonja - portfolio créatif et technique

source: Thibault Santonja - Creative and technical portfolio, explore artistic photography, historical research, software projects, and creative works.
fr: Thibault Santonja - Portfolio créatif et technique, explore la photographie artistique, la recherche historique, les projets de logiciels et les travaux créatifs.

source: Thibault Santonja – Creative portfolio
fr: Thibault Santonja - Portfolio créatif

source: Thibault Santonja for Seigneurie de Coucy - find out more about the activities of the association, its events, historical re-enactments and publications about life in the 14th century.
fr: Thibault Santonja pour la Seigneurie de Coucy - en savoir plus sur les activités de l'association, ses manifestations, ses reconstitutions historiques et ses publications sur la vie au XIVe siècle.

source: 1. Basic Garments
fr: 1. Éléments de base de l’habillement

source: 2. Materials and Colors
fr: 2. Matériaux et couleurs

source: 3. Accessories
fr: 3. Accessoires

source: 4. Sumptuary Laws
fr: 4. Lois Somptuaires

source: About
fr: À propos

source: Gallery
fr: Galerie

source: Medieval re-enactment troupe
fr: Troupe médiévale de reconstitution historique
